#include <stdio.h>

int main(){
    int score = 90.5;
    printf("score:%.1f\n",score);
        return 0;
}

// ผลลัพธ์ที่ได้ต่างตรงที่ ถ้าใช้int score จะทำให้ผลลัพธ์ที่ได้เป็น 90 ถ้าใช้ float score จะทำให้ผลลัพธ์ที่ได้เป็น 90.5
//ทำไมต้องเลือก data type ให้ถูก  เพราะถ้าเลือก data type ไม่ถูก จะทำให้ผลลัพธ์ไม่ตรงกับที่กำหนด
//สรุปผลการทดลอง ทำให้เห็นการใช้งานData type ที่แตกต่างกันและผลลัพธ์ที่ได้จะต่างกัน
//int จะใช้กับตัวแปรที่เป็นจำนวนเต็มเท่านั้น ส่วน float จะใช้กับตัวแปรที่เป็นจำนวนทศนิยม